{
  "userid": "117833704731893145427",
  "time": "2025-07-03T03:44:45.809Z",
  "type": "visit",
  "event": "create",
  "data": {
    "id": "id.380623663",
    "VisitTime": 1751514284952,
    "Profile": "https://www.linkedin.com/in/simonsayssecurity",
    "SalesProfile": "https://www.linkedin.com/sales/lead/ACwAABav2y8Bb9mJfamPKs17YOiNhO6aRDxsAmo,NAME_SEARCH,8aXv",
    "RecruiterProfile": "https://www.linkedin.com/talent/profile/ACwAABav2y8Bb9mJfamPKs17YOiNhO6aRDxsAmo",
    "Picture": "https://media.licdn.com/dms/image/v2/C5603AQEe7h-w-ThF_A/profile-displayphoto-shrink_100_100/profile-displayphoto-shrink_100_100/0/1610053862023?e=1756944000&v=beta&t=pnK540HLNvChOHRY8Hh1PyhKV1zMcejAYZFZhHprshI",
    "Degree": "1",
    "First Name": "Jose",
    "Middle Name": "",
    "Last Name": "Simon",
    "Connections": "4221",
    "Summary": "As the Enterprise Regional Director at Fortified Health Security, my focus is on crafting high-touch, customized cybersecurity programs that amplify our clients' existing security measures and systematically elevate their defensive posture within the healthcare industry. Our team's dedication to understanding and mitigating complex security risks contributes to the safeguarding of critical patient data, a responsibility I uphold with unwavering commitment.\n\nMy tenure at Kudelski Security fortified my ability to cultivate enduring partnerships and drive strategic initiatives that significantly enhance organizational security effectiveness. Recognized for my contribution to our team's success with multiple awards, including the Herjavec Group President's Club and the Kudelski Security Newcomer Award, my leadership is characterized by a blend of strong communication, keen analytical acumen, and a passion for team motivation.",
    "From": "2024",
    "Title": "Enterprise Regional Director",
    "Company": "Fortified Health Security",
    "CompanyProfile": "https://www.linkedin.com/company/8504332/",
    "CompanyWebsite": "http://www.fortifiedhealthsecurity.com",
    "Email": "jose.simon1522@gmail.com",
    "Phone": "2132393345",
    "IM": "",
    "Twitter": "",
    "Location": "Los Angeles, California, United States",
    "Industry": "Computer and Network Security",
    "My Tags": [],
    "extended": {
      "positions": [
        {
          "Company": "Fortified Health Security",
          "Title": "Enterprise Regional Director",
          "Description": "Fortified is Healthcare’s Cybersecurity Partner® – protecting patient data and reducing risk throughout the healthcare ecosystem.\n\nAs a managed security service provider, Fortified works alongside healthcare organizations to build tailored programs designed to leverage their prior security investments and current processes while implementing new solutions intended to reduce risk and increase their security posture over time. Fortified’s high-touch engagements and customized recommendations maximize the value of investments and result in actionable information to help reduce the risk of cyber events.\n\nDiscover how Fortified's Central Command can simplify the complexity of managing your Fortified cybersecurity services.\n\nCentral Command consolidates your cybersecurity program in one location, making it easier for you to manage risks, monitor threats, quickly respond to incidents, and work more efficiently.",
          "From": "5 - 2024",
          "To": ""
        },
        {
          "Company": "Kudelski Security",
          "Title": "Account Executive",
          "Description": "Kudelski Security Recognized as Leader in The Forrester Wave™: Midsize MSSPs, Q3 2020\n\nKudelski Security is a premier cybersecurity solutions provider, working with the most security-conscious organizations in Europe and across the United States. Our long-term approach to client partnerships enables us to continuously evaluate their security posture to design and deliver solutions to reduce business risk, maintain compliance and increase overall security effectiveness.\n\nFor more information about capabilities including consulting, technology, managed security services or custom innovation, visit: www.kudelskisecurity.com",
          "From": "10 - 2020",
          "To": "5 - 2024"
        },
        {
          "Company": "The DigiTrust Group",
          "Title": "Senior Account Executive",
          "Description": "",
          "From": "5 - 2020",
          "To": "8 - 2020"
        },
        {
          "Company": "Cyderes",
          "Title": "Account Executive – U.S. Sales",
          "Description": "Driven sales professional looking to solve the most complex information risks at all business levels. Proven ability with the global cyber security leader - Herjavec Group.\n\nDynamic Information Security entrepreneur Robert Herjavec founded Herjavec Group in 2003, and it quickly became one of North America’s fastest-growing technology companies, accelerating from $400K to $170 million in sales annually over 12 years. \n\nAt Herjavec Group, your information security is our topmost priority as we work diligently around the clock to protect the assets of your business including employees, data, IT infrastructure and information. \n\nWe deliver managed security services globally supported by a state-of-the-art, PCI compliant Security Operations Center (SOC), operated 24/7/365 by certified security professionals. This expertise is coupled with a leadership position across a wide range of functions including compliance, risk management & incident response. \n\nLet's connect: +1(213) 239-3345 or jsimon@herjavecgroup.com",
          "From": "7 - 2017",
          "To": "3 - 2020"
        },
        {
          "Company": "Westlake Financial Services",
          "Title": "Dealer Account Manager",
          "Description": "• Present and sell company products and services to all levels of management within the dealership\n• Prepare action plans and schedules to identify specific targets and to project the number of contacts made\n• Follow-up on new leads and referrals resulting from field activity in both independent and franchise dealers\n• Identify sales prospects and contact these and other accounts assigned to you\n• Prepare presentations and proposals for all levels of management within in dealership \n• Assist with the preparation of sales contracts by educating the dealer on what is needed for proper verification by Westlake Financial\n• Develop and maintain current client and potential client relationships within the independent and franchise dealer communities\n• Develop, maintain and understand sales materials and keep up to date on current financial product knowledge\n• Participate in marketing events such as seminars, trade shows, and telemarketing events for independent and franchise dealers.",
          "From": "2 - 2016",
          "To": "4 - 2017"
        },
        {
          "Company": "NISSAN - Universal Motors Corporation",
          "Title": "Internet Sales Manager",
          "Description": "The Internet Sales Manager manages the online sales conducted through our website. The Internet Manager is primarily responsible for establishing contact with potential customers and set appointments for customers to meet with sales consultants.\n• Answer all incoming calls and chat/call requests within 10 seconds.\n• Respond to incoming e-mail with an attempted phone call in 5 minutes or less, followed up with a series of outgoing e-mails that end in a price quote within 10 minutes (measured from time from ISC’s auto-response).\n• Convert every sales opportunity to a confirmed appointment or turn them to a Sales Consultant.\n• Actually speak with at least 75% of all assigned leads.\n• Set confirmed appointments with at least 60% of the leads you make contact with.\n• Maintain a 60% show rate with those appointments.\n• Record every contact you have with customers, regardless of source or type, in the LSMS.\n• Complete 100% of your daily scheduled contact tasks.\n• Other duties as assigned.\n",
          "From": "2 - 2015",
          "To": "2 - 2016"
        },
        {
          "Company": "AV Communications",
          "Title": "Cellular Business Manager",
          "Description": "-Opening and setting up the establishment for the workday\n-Courteously greet customers and efficiently process transactions within busy, fast-paced retail environments\n-Balance drawers at the end of each shift\n-Ability to explain technical or complicated issues in a comprehensive manner\n-Strengths in championing products, researching competition and selling the benefits\n-Proficient in Microsoft Office\n-In charge of daily inventory of the business\n-Public Representative for Business",
          "From": "3 - 2013",
          "To": "1 - 2015"
        }
      ],
      "skills": [
        "Management",
        "Sales",
        "Leadership",
        "Account Management",
        "Communication",
        "Marketing Strategy",
        "Strategic Planning",
        "Team Building",
        "Microsoft Excel",
        "Analytical Skills",
        "Team Motivation",
        "Information Technology",
        "Cybersecurity",
        "Team Leadership"
      ],
      "schools": [
        {
          "Name": "University of La Verne",
          "Degree": "Bachelor's degree",
          "Field": "Business Administration, Management and Operations",
          "From": "2012",
          "To": "2016"
        },
        {
          "Name": "Edward R Roybal LC",
          "Degree": "High School Diploma",
          "Field": "Business Administration, Management and Operations",
          "From": "2008",
          "To": "2012"
        }
      ]
    },
    "My Notes": []
  }
}