{
  "event_id": "event_1751514358422",
  "event_type": "visit",
  "event_name": "create",
  "profile_url": null,
  "dux_user_id": "117833704731893145427",
  "timestamp": "2025-07-02 20:45:58.422524",
  "raw_data": {
    "userid": "117833704731893145427",
    "time": "2025-07-03T03:45:57.823Z",
    "type": "visit",
    "event": "create",
    "data": {
      "id": "id.56249693",
      "VisitTime": 1751514356492,
      "Profile": "https://www.linkedin.com/in/jasondauer",
      "SalesProfile": "https://www.linkedin.com/sales/lead/ACwAAANaTV0BuiSnYqCexkYdiTyxpb56MVVz0ns,NAME_SEARCH,bRC0",
      "RecruiterProfile": "https://www.linkedin.com/talent/profile/ACwAAANaTV0BuiSnYqCexkYdiTyxpb56MVVz0ns",
      "Picture": "https://media.licdn.com/dms/image/v2/C4D03AQFS7qNG3TXYBw/profile-displayphoto-shrink_100_100/profile-displayphoto-shrink_100_100/0/1516612994435?e=1756944000&v=beta&t=ObQol486KMyA5W95Gk53T08VBYp-bQw75cEM4GicHB4",
      "Degree": "1",
      "First Name": "Jason",
      "Middle Name": "",
      "Last Name": "Dauer",
      "Connections": "3599",
      "Summary": "With a strong track record of success in Cyber Security Sales, Jason enjoys building long term relationships with clients, partners, and team members.  Solving challenges with clients or inspiring and leading his team to do so are key tenants of how he has made an impact in this industry for the past 10+ years.  \n\nWith sincere passion, hard work, strategic planning and a long-term view, Jason is leading his team as our industry adjusts and adapts to new threats and fundamental changes to how our clients operate and secure their business.\n\nWhen not achieving the above, you may find Jason spending time with family, playing tennis, or engaged in a complex/strategic board game.\n",
      "From": "2019",
      "Title": "Regional Director",
      "Company": "Optiv Inc",
      "CompanyProfile": "https://www.linkedin.com/company/10016224/",
      "CompanyWebsite": "http://www.optiv.com",
      "Email": "jason.dauer@optiv.com",
      "Phone": "(310) 993-9802",
      "IM": "",
      "Twitter": "",
      "Location": "Los Angeles, California, United States",
      "Industry": "Computer and Network Security",
      "My Tags": [],
      "extended": {
        "positions": [
          {
            "Company": "Optiv Inc",
            "Title": "Regional Director",
            "Description": "Customer Advocate & Sales Leader - Enterprise Segment - Southern California",
            "From": "10 - 2019",
            "To": ""
          },
          {
            "Company": "Optiv Inc",
            "Title": "Senior Client Manager",
            "Description": "Senior Security Sales and Account Management Professional exceeding company and customer expectations for a select collection of Enterprise Accounts in the Greater Los Angeles area.\n\nOptiv Achievements\n•\tTop 10 Account Manager for the region each year\n•\tNational Recognition - Force Management methodology 1st place winner out of 800 peers\n•\tMentor to peers on the team; leveraging background as a Sales People Manager\n\nOptiv Info:\nOptiv is the most advanced, most comprehensive and most trusted partner for cyber security solutions. We provide a full suite of information security services and solutions that help define cyber security strategy, identify and remediate threats and risks, select and deploy the right technology, and achieve operational readiness to protect from malicious attack.\n\nOptiv was born from a merger of Accuvant and FishNet Security during the first half of 2015.",
            "From": "7 - 2015",
            "To": "9 - 2019"
          },
          {
            "Company": "FishNet Security",
            "Title": "Account Executive",
            "Description": "Seasoned Security Sales Professional focused on Major Accounts in the Greater Los Angeles area.\n\nFishNet Security Achievements\n•\t2013 Western Region Rookie of the Year Award\n•\t2014 President's Club\n\nFishNet Security Info:\nFounded in 1996, we help enable our clients to manage risk, meet compliance requirements and reduce costs while maximizing security effectiveness and operational efficiency.  We have over 5,000 customers worldwide and can help consolidate communication to one trusted partner.    \n\n---FishNet Security has achieved the most elite partner status with virtually all industry-leading security technology companies.\n---FishNet Security has invested in in-house testing labs for performing detailed product evaluations to provide an in-depth understanding, of the recommended products that will work best for your specific environment.\n---Experienced FishNet Security support staff and effective case management processes combine to create efficient, cost-effective product support options that help our clients stop security threats. ---FishNet's consultants have deep technical background and experience with a commitment to quality of service.\n---FishNet's experienced professionals hold numerous certifications, including CISSP, CISM, CISA, ISO Lead Auditor, PCI QSA, PCI-PA-QSA, NSA-IAM, OSCP and countless technology-focused certifications\n---FishNet's Consulting team consists of seasoned former Big Four professional services firm consultants, Security Technical consultants, real-world industry practitioners and corporate security program directors",
            "From": "3 - 2013",
            "To": "7 - 2015"
          },
          {
            "Company": "Rapid7",
            "Title": "People Manager - Sales Western Region",
            "Description": "Rapid7 offers Nexpose and Metasploit, two of the top software products for vulnerability management and penetration testing.\n\nWorked as a hands-on manager of a team of 4 people focused on generating net new business in the Southwest Region: Southern California, Colorado, Utah, New Mexico, Arizona, and Hawaii.\n\nReported directly to the VP of Sales for North America and co-managed the Los Angeles office staff of 8 people (4 direct reports to me).\n\nPeople Manager - Southwest Region - Highlights\n• Maintained 121% to plan for sales team 2012 (includes billings from 3 AEs and my own billings)\n• Finished as the 2nd highest billing manager in 2012 ($1,039,867 in new bookings)\n• Maintained strong customer relationships and cultivated new ones through numerous onsite meetings and effective solution and value selling\n• Finished in the top 25% of all sales people for new bookings while motivating, coaching, training and mentoring a team of 3 sales AEs and 1 sales engineer\n• Facilitated a 33% increase in the Southwest region per AE 2012 new bookings number compared to 2011 (increased by over 245% in December 2012)\n• Mentored Sr. Account Executive which culminated in her becoming the top biller in the Americas in December 2012\n• Hired and developed 2 entry level sales reps and helped them achieve success in generating new bookings and working a full life cycle solution sales process\n• Developed a strong Go-to-Market plan which included enterprise account development, field work, working with strategic partners, marketing events and creative business development activities\n• Co-led the West Coast office to achieve record breaking new booking numbers in 3 out of the last 4 months in 2012\n• Consistently forecasted accurately (within 10% +/-) monthly and quarterly",
            "From": "10 - 2009",
            "To": "2 - 2013"
          },
          {
            "Company": "Rapid7",
            "Title": "Sales Team Lead (People Manager in Training)",
            "Description": "• Achieved 114% to plan for individual billing in 2011 ($1,135,828 in new bookings)\n• Finished in the top 10 for FY11 \n• Number one most consistent rep based on average month/standard deviation\n• Aided Sales Manager/Director in training and development of the team\n• Expanded Rapid7 brand and presence in the Midwest (MO, KS) and Southern California\n• Excelled in face to face client meetings and presentations\n• Developed and implemented strategic weekly plans to maximize efficiency, drive fuel, and increase sales numbers, while prioritizing work in enterprise accounts\n• Built, managed and mentored a sales team of 2+ trainees through successful implementation of on the desk training and a series of one-on-one meetings.  Results include: advanced trainee skillsets, rapid pipe development, and increased moral among team members\n• Routinely assumed responsibilities above and beyond held position including: initiating, creating, and implementing regular meetings for sales team that lead to increased knowledge and understanding of sales content and strategy\n• Proactively recruited and screened potential candidates to staff teams with talented sales hires who promote new and positive energy on the sales floor\n• Fostered strong inter-department relationships to help increase sales performance, transfer knowledge, and streamline communication among channels",
            "From": "2 - 2011",
            "To": "12 - 2011"
          },
          {
            "Company": "Rapid7",
            "Title": "Account Executive",
            "Description": "• Managed sales forecast and consistently contributed to the top sales team in the company\n• Delivered consistent monthly bookings\n• Increased pipe, deal size, and deal volume as the year progressed\n• Structured a multi-year services deal with a 2 billion dollar international company",
            "From": "6 - 2010",
            "To": "1 - 2011"
          },
          {
            "Company": "Rapid7",
            "Title": "Business Development Representative (BDR)",
            "Description": "Software sales for a fast growing enterprise security company\n• Fuel and pipe development leader\n• Quick learner: nicknamed \"Sponge\" for my ability to absorb meeting content",
            "From": "10 - 2009",
            "To": "5 - 2010"
          },
          {
            "Company": "Holistic Doctor Group",
            "Title": "Partner; Business Manager",
            "Description": "• Partner (fully responsible owner)\n• Created and implemented a strategic plan for business growth\n• Increased sales through customer education and marketing events\n• Oversaw the staff, conducted meetings, and hired new staff members\n• Audited bank accounts and removed unnecessary expenses; improved net income by 17% as a result\n• Managed all aspects of business increasing profitability levels to a new 5-year high; Exceeded 2007 Gross Income by over 12% during the same time period \n• Revitalized organization increasing monthly collections by over $5,000 each month; Gross income hit highest mark since 2000\n• Managed three employees and two salaried professionals",
            "From": "7 - 1999",
            "To": "12 - 2007"
          }
        ],
        "skills": [
          "Account Management",
          "Sales Enablement",
          "Sales Target Management",
          "Written Communication",
          "Presentation Skills",
          "Exceeding Targets",
          "Employee Learning & Development",
          "Communication",
          "Sales Leadership",
          "Organizational Planning",
          "Executive Relationships",
          "Enterprise Accounts",
          "Business-to-Business (B2B)",
          "Marketing Analytics",
          "High-Tech Sales",
          "Communication Training",
          "Presentations",
          "Investing",
          "Demand Generation",
          "Complex Sales",
          "Sales Processes",
          "Sales Strategy",
          "Leadership",
          "Sales Management",
          "Team Building",
          "Leading Meetings",
          "Coaching",
          "Hiring Practices",
          "Forecasting",
          "Sales",
          "Strategic Partnerships",
          "Building Relationships",
          "Channel Sales",
          "New Business Development",
          "Organization",
          "NetSuite",
          "Salesforce.com",
          "Information Security",
          "Network Security",
          "Managed Security Services",
          "Enterprise Software",
          "Computer Hardware",
          "Risk Assessment",
          "PCI DSS",
          "Vulnerability Management",
          "Penetration Testing",
          "NeXpose",
          "Metasploit",
          "CRM",
          "Solution Selling",
          "Professional Services",
          "Lead Generation"
        ],
        "schools": [
          {
            "Degree": "BS",
            "Field": "Business Adminstration; Entrepreneurship",
            "From": "2004",
            "To": "2007"
          }
        ]
      },
      "My Notes": []
    }
  },
  "processed": false
}